app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		# Busca todos los registros
		@articles = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
		# Busca un registro por su id
		@articles = Article.find(params[:id])

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post Nuevo"], ["body", "Post creado!! "], ["created_at", "2016-12-11 02:37:45.579953"], ["updated_at", "2016-12-11 02:37:45.579953"]]
---
	def create
		@articles = Article.new(article_params)

		if @articles.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
---
	def destroy
		@articles = Article.find(params[:id])
		@articles.destroy # Elimina el objeto de la BD